### Part 1 - Student details:
* Please write the First Name and last 4 digits of the i.d. for each student. For example:
<pre>Israel 7938</pre>

In [ ]:
# student 1: Israel 7938
# student 2: Eran 6215
# student 3: Avihai 2474
# student 4: Almog 8269 TESTTTTTTTTTTTTTTTTTT
# student 5: Liron 5068
# student 6: Matan ####

SyntaxError: invalid syntax (1739801622.py, line 1)

## Part 2 - Experiments
You could add as many code cells as needed

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sklearn as sklearn

In [13]:
url = "https://raw.githubusercontent.com/eranCat/TitanicML/main/titanic_test.csv"
testset = pd.read_csv(url)

In [14]:
trainset.head()

   Pclass  Sex        Age  SibSp  Parch     Fare  Embarked  Survived
0       3    1  35.000000      0      0   7.0500         0         0
1       3    1  30.000000      0      0   7.2500         0         0
2       3    1  29.699118      0      0  14.5000         0         0
3       3    0  21.000000      0      0   7.7500         2         0
4       3    1  32.000000      0      0  56.4958         0         1

In [48]:
trainset = pd.read_csv("titanic_train.csv")

In [49]:
trainset.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked  Survived
0       1    0  54.0      1      0  78.2667         1         1
1       2    0  45.0      0      0  13.5000         0         1
2       3    1  20.0      0      0   9.5000         0         0
3       3    1  36.0      0      0   7.8958         0         0
4       3    1  22.0      0      0   8.0500         0         0

In [50]:
testset = pd.read_csv("titanic_test.csv")

In [51]:
testset.head()

   Pclass  Sex        Age  SibSp  Parch     Fare  Embarked  Survived
0       3    1  35.000000      0      0   7.0500         0         0
1       3    1  30.000000      0      0   7.2500         0         0
2       3    1  29.699118      0      0  14.5000         0         0
3       3    0  21.000000      0      0   7.7500         2         0
4       3    1  32.000000      0      0  56.4958         0         1

## Part 3 - Training flow
Use the best combination of feature engineering, model (algorithm and hyperparameters) from the experiment part (part 2)

In [52]:
trainset.describe()

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
count,712.000000,712.000000,712.000000,712.000000,712.000000,712.000000,712.000000,712.000000
mean,2.294944,0.640449,29.531213,0.528090,0.384831,32.379429,0.372191,0.394663
std,0.841990,0.480206,13.188028,1.055052,0.803085,49.836074,0.649970,0.489122
min,1.000000,0.000000,0.670000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,1.750000,0.000000,22.000000,0.000000,0.000000,7.925000,0.000000,0.000000
50%,3.000000,1.000000,29.699118,0.000000,0.000000,14.500000,0.000000,0.000000
75%,3.000000,1.000000,35.000000,1.000000,0.000000,31.275000,1.000000,1.000000
max,3.000000,1.000000,80.000000,8.000000,6.000000,512.329200,3.000000,1.000000

In [53]:
print((trainset['Survived']==0).sum())

431

In [54]:
trainset['Parch'].unique()

array([0, 1, 2, 3, 4, 5, 6], dtype=int64)

In [58]:
trainset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 712 entries, 0 to 711
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    712 non-null    int64
 1   Sex       712 non-null    int64
 2   Age       712 non-null    float64
 3   SibSp     712 non-null    int64
 4   Parch     712 non-null    int64
 5   Fare      712 non-null    float64
 6   Embarked  712 non-null    int64
 7   Survived  712 non-null    int64
dtypes: float64(2), int64(6)
memory usage: 44.6 KB

In [56]:
trainset.head(100)

    Pclass  Sex   Age  SibSp  Parch     Fare  Embarked  Survived
0        1    0  54.0      1      0  78.2667         1         1
1        2    0  45.0      0      0  13.5000         0         1
2        3    1  20.0      0      0   9.5000         0         0
3        3    1  36.0      0      0   7.8958         0         0
4        3    1  22.0      0      0   8.0500         0         0
..     ...  ...   ...    ...    ...      ...       ...       ...
95       1    1  42.0      0      0  26.2875         0         1
96       3    1   3.0      4      2  31.3875         0         1
97       3    1   1.0      1      2  20.5750         0         1
98       1    1  65.0      0      1  61.9792         1         0
99       3    0   9.0      3      2  27.9000         0         0

[100 rows x 8 columns]

## Part 4 - Apply on test and show model performance estimation